### Parte 6

In [71]:
## Tratamento de dados faltantes

In [72]:
import pandas as pd

In [73]:
dados = pd.read_csv("aluguel_residencial.csv", sep=";")
dados.head(10)

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,0.0,0.0
2,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
3,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,0.0
4,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0
5,Casa de Condomínio,Barra da Tijuca,5,4,5,750,22000.0,0.0,0.0
6,Casa de Condomínio,Ramos,2,2,0,65,1000.0,0.0,0.0
7,Apartamento,Grajaú,2,1,0,70,1500.0,642.0,74.0
8,Apartamento,Lins de Vasconcelos,3,1,1,90,1500.0,455.0,14.0
9,Apartamento,Copacabana,1,0,1,40,2000.0,561.0,50.0

In [74]:
dados.isnull() ## se o dado no dataframe for null ele marca como true

        Tipo  Bairro  Quartos  Vagas  Suites   Area  Valor  Condominio   IPTU
0      False   False    False  False   False  False  False       False  False
1      False   False    False  False   False  False  False       False  False
2      False   False    False  False   False  False  False       False  False
3      False   False    False  False   False  False  False       False  False
4      False   False    False  False   False  False  False       False  False
...      ...     ...      ...    ...     ...    ...    ...         ...    ...
22364  False   False    False  False   False  False  False       False  False
22365  False   False    False  False   False  False  False       False  False
22366  False   False    False  False   False  False  False       False  False
22367  False   False    False  False   False  False  False       False  False
22368  False   False    False  False   False  False  False       False  False

[22369 rows x 9 columns]

In [75]:
dados.notnull() ## contrário do isnull(), ou seja, marca false se a informação for null

       Tipo  Bairro  Quartos  Vagas  Suites  Area  Valor  Condominio  IPTU
0      True    True     True   True    True  True   True        True  True
1      True    True     True   True    True  True   True        True  True
2      True    True     True   True    True  True   True        True  True
3      True    True     True   True    True  True   True        True  True
4      True    True     True   True    True  True   True        True  True
...     ...     ...      ...    ...     ...   ...    ...         ...   ...
22364  True    True     True   True    True  True   True        True  True
22365  True    True     True   True    True  True   True        True  True
22366  True    True     True   True    True  True   True        True  True
22367  True    True     True   True    True  True   True        True  True
22368  True    True     True   True    True  True   True        True  True

[22369 rows x 9 columns]

In [76]:
dados.info()
# note que é possível perceber que as variaveis valor, condominio, sobretudo, o IPTU contém valores nulos

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22369 entries, 0 to 22368
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Tipo        22369 non-null  object
 1   Bairro      22369 non-null  object
 2   Quartos     22369 non-null  int64
 3   Vagas       22369 non-null  int64
 4   Suites      22369 non-null  int64
 5   Area        22369 non-null  int64
 6   Valor       22369 non-null  float64
 7   Condominio  22369 non-null  float64
 8   IPTU        22369 non-null  float64
dtypes: float64(3), int64(4), object(2)
memory usage: 1.5+ MB

In [77]:
dados[dados['Valor'].isnull()]
# mostrando o dataFrame em que o campo valor é nulo

Empty DataFrame
Columns: [Tipo, Bairro, Quartos, Vagas, Suites, Area, Valor, Condominio, IPTU]
Index: []

In [78]:
## testando o metodo dropna para eliminar as tuplas que contem o campo valor null
dados.dropna(subset=['Valor'], inplace=True)
## o attr subset recebe uma lista dos valores (colunas) que vão ser verificadas para remoção
dados[dados['Valor'].isnull()] # constatando que os valores foram removidos

Empty DataFrame
Columns: [Tipo, Bairro, Quartos, Vagas, Suites, Area, Valor, Condominio, IPTU]
Index: []

In [79]:
dados[dados['Condominio'].isnull()].shape[0]

0

In [80]:
selecao = (dados['Tipo'] == 'Apartamento') & (dados['Condominio'].isnull())

In [81]:
dados = dados[~selecao] # o operador ~ na frente de uma var/series booleana inverte o valor
dados[dados['Condominio'].isnull()].shape[0]

0

In [82]:
## preenchendo os valores NaN
dados = dados.fillna({'Condominio': 0, 'IPTU': 0})
dados[dados['Condominio'].isnull()].shape[0]
## o método fillna() aceita o param inplace. Não foi utilizado para mostrar que é possível
## passar um dicionário para personalizar a substituição de cada variável específica

0

In [83]:
dados.info() # mostrando que não temos mais valores nulos na nossa base

<class 'pandas.core.frame.DataFrame'>
Int64Index: 22369 entries, 0 to 22368
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Tipo        22369 non-null  object
 1   Bairro      22369 non-null  object
 2   Quartos     22369 non-null  int64
 3   Vagas       22369 non-null  int64
 4   Suites      22369 non-null  int64
 5   Area        22369 non-null  int64
 6   Valor       22369 non-null  float64
 7   Condominio  22369 non-null  float64
 8   IPTU        22369 non-null  float64
dtypes: float64(3), int64(4), object(2)
memory usage: 1.7+ MB

In [84]:
dados.to_csv("aluguel_residencial.csv", sep=";", index=False)
# atualizando a base

#### Extra

In [85]:
## métodos de interpolação

In [86]:
data = [0.5, None, None, 0.52, None, None, 0.59, 0.6, None, 0.7]
s = pd.Series(data)
s

0    0.50
1     NaN
2     NaN
3    0.52
4     NaN
5     NaN
6    0.59
7    0.60
8     NaN
9    0.70
dtype: float64

In [87]:
s.fillna(0) # substituição simples

0    0.50
1    0.00
2    0.00
3    0.52
4    0.00
5    0.00
6    0.59
7    0.60
8    0.00
9    0.70
dtype: float64

In [88]:
s.fillna(method='ffill')
# o metodo ffill preenche o valor nulo com o valor anterior de cima para baixo

0    0.50
1    0.50
2    0.50
3    0.52
4    0.52
5    0.52
6    0.59
7    0.60
8    0.60
9    0.70
dtype: float64

In [89]:
s.fillna(method='bfill')
## o metodo bfill é o oposto do ffill. Preenche o valor nulo com o valor anterior de baixo para cima

0    0.50
1    0.52
2    0.52
3    0.52
4    0.59
5    0.59
6    0.59
7    0.60
8    0.70
9    0.70
dtype: float64

In [90]:
s.fillna(s.mean())
# é possível preencher os valores nulos com a média dos n nulos

0    0.500
1    0.582
2    0.582
3    0.520
4    0.582
5    0.582
6    0.590
7    0.600
8    0.582
9    0.700
dtype: float64

In [91]:
s.fillna(method='ffill', limit=1)
# estabelecendo o limite para o preenchimento, ou seja, ele só preencheu o primeiro valor NaN por exemplo

0    0.50
1    0.50
2     NaN
3    0.52
4    0.52
5     NaN
6    0.59
7    0.60
8    0.60
9    0.70
dtype: float64

### Parte 7

In [92]:
## atribuindo nova variável
dados['Valor Bruto'] = dados['Valor'] + dados['Condominio'] + dados['IPTU']

In [93]:
dados.head(10)

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU,Valor Bruto
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0,2260.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,0.0,0.0,7000.0
2,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0,1210.0
3,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,0.0,1030.0
4,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0,1618.0
5,Casa de Condomínio,Barra da Tijuca,5,4,5,750,22000.0,0.0,0.0,22000.0
6,Casa de Condomínio,Ramos,2,2,0,65,1000.0,0.0,0.0,1000.0
7,Apartamento,Grajaú,2,1,0,70,1500.0,642.0,74.0,2216.0
8,Apartamento,Lins de Vasconcelos,3,1,1,90,1500.0,455.0,14.0,1969.0
9,Apartamento,Copacabana,1,0,1,40,2000.0,561.0,50.0,2611.0

In [94]:
## atribuindo nova variável
dados['Valor m2'] = dados['Valor'] / dados['Area']
dados.head(10)

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU,Valor Bruto,Valor m2
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0,2260.0,42.500000
1,Casa,Jardim Botânico,2,0,1,100,7000.0,0.0,0.0,7000.0,70.000000
2,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0,1210.0,53.333333
3,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,0.0,1030.0,16.666667
4,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0,1618.0,26.000000
5,Casa de Condomínio,Barra da Tijuca,5,4,5,750,22000.0,0.0,0.0,22000.0,29.333333
6,Casa de Condomínio,Ramos,2,2,0,65,1000.0,0.0,0.0,1000.0,15.384615
7,Apartamento,Grajaú,2,1,0,70,1500.0,642.0,74.0,2216.0,21.428571
8,Apartamento,Lins de Vasconcelos,3,1,1,90,1500.0,455.0,14.0,1969.0,16.666667
9,Apartamento,Copacabana,1,0,1,40,2000.0,561.0,50.0,2611.0,50.000000

In [95]:
# formatando casas decimais
dados['Valor m2'] = dados['Valor m2'].round(2) # arredondando em 2 casas decimais
dados

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU,Valor Bruto,Valor m2
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0,2260.0,42.50
1,Casa,Jardim Botânico,2,0,1,100,7000.0,0.0,0.0,7000.0,70.00
2,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0,1210.0,53.33
3,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,0.0,1030.0,16.67
4,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0,1618.0,26.00
...,...,...,...,...,...,...,...,...,...,...,...
22364,Apartamento,Méier,2,0,0,70,900.0,490.0,48.0,1438.0,12.86
22365,Quitinete,Centro,0,0,0,27,800.0,350.0,25.0,1175.0,29.63
22366,Apartamento,Jacarepaguá,3,1,2,78,1800.0,800.0,40.0,2640.0,23.08
22367,Apartamento,São Francisco Xavier,2,1,0,48,1400.0,509.0,37.0,1946.0,29.17
22368,Apartamento,Leblon,2,0,0,70,3000.0,760.0,0.0,3760.0,42.86

In [96]:
## atribuindo nova variável
dados['Valor Bruto m2'] = (dados['Valor Bruto'] / dados['Area']).round(2)
dados.head(10)

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU,Valor Bruto,Valor m2,Valor Bruto m2
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0,2260.0,42.50,56.50
1,Casa,Jardim Botânico,2,0,1,100,7000.0,0.0,0.0,7000.0,70.00,70.00
2,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0,1210.0,53.33,80.67
3,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,0.0,1030.0,16.67,21.46
4,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0,1618.0,26.00,32.36
5,Casa de Condomínio,Barra da Tijuca,5,4,5,750,22000.0,0.0,0.0,22000.0,29.33,29.33
6,Casa de Condomínio,Ramos,2,2,0,65,1000.0,0.0,0.0,1000.0,15.38,15.38
7,Apartamento,Grajaú,2,1,0,70,1500.0,642.0,74.0,2216.0,21.43,31.66
8,Apartamento,Lins de Vasconcelos,3,1,1,90,1500.0,455.0,14.0,1969.0,16.67,21.88
9,Apartamento,Copacabana,1,0,1,40,2000.0,561.0,50.0,2611.0,50.00,65.28

In [97]:
dados['Tipo'].unique()

array(['Quitinete', 'Casa', 'Apartamento', 'Casa de Condomínio', 'Flat',
       'Casa de Vila', 'Loft', 'Chácara', 'Loteamento/Condomínio',
       'Sítio'], dtype=object)

In [98]:
casa = ['Casa', 'Casa de Condomínio', 'Casa de Vila']

In [99]:
dados['Tipo Agregado'] = dados['Tipo'].apply(lambda x: 'Casa' if x in casa else 'Apartamento')

# o método apply() permite que apliquemos uma função à cada registro do DataFrame

In [100]:
dados.head(20)

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU,Valor Bruto,Valor m2,Valor Bruto m2,Tipo Agregado
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0,2260.0,42.50,56.50,Apartamento
1,Casa,Jardim Botânico,2,0,1,100,7000.0,0.0,0.0,7000.0,70.00,70.00,Casa
2,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0,1210.0,53.33,80.67,Apartamento
3,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,0.0,1030.0,16.67,21.46,Apartamento
4,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0,1618.0,26.00,32.36,Apartamento
5,Casa de Condomínio,Barra da Tijuca,5,4,5,750,22000.0,0.0,0.0,22000.0,29.33,29.33,Casa
6,Casa de Condomínio,Ramos,2,2,0,65,1000.0,0.0,0.0,1000.0,15.38,15.38,Casa
7,Apartamento,Grajaú,2,1,0,70,1500.0,642.0,74.0,2216.0,21.43,31.66,Apartamento
8,Apartamento,Lins de Vasconcelos,3,1,1,90,1500.0,455.0,14.0,1969.0,16.67,21.88,Apartamento
9,Apartamento,Copacabana,1,0,1,40,2000.0,561.0,50.0,2611.0,50.00,65.28,Apartamento
10,Quitinete,Copacabana,1,0,0,27,1800.0,501.0,0.0,2301.0,66.67,85.22,Apartamento
11,Apartamento,Copacabana,4,3,1,243,13000.0,2000.0,803.0,15803.0,53.50,65.03,Apartamento
12,Flat,Botafogo,3,1,1,80,3800.0,1040.0,0.0,4840.0,47.50,60.50,Apartamento
13,Casa de Condomínio,Taquara,3,1,1,115,2000.0,0.0,0.0,2000.0,17.39,17.39,Casa
14,Apartamento,Freguesia (Jacarepaguá),3,0,0,54,950.0,300.0,28.0,1278.0,17.59,23.67,Apartamento
15,Apartamento,Barra da Tijuca,2,1,1,67,1700.0,589.0,147.0,2436.0,25.37,36.36,Apartamento
16,Apartamento,Tijuca,2,1,0,110,1900.0,700.0,138.0,2738.0,17.27,24.89,Apartamento
17,Casa de Condomínio,Barra da Tijuca,4,3,2,466,7500.0,2695.0,0.0,10195.0,16.09,21.88,Casa
18,Apartamento,Olaria,3,1,0,68,1000.0,670.0,0.0,1670.0,14.71,24.56,Apartamento
19,Apartamento,Tijuca,2,1,0,78,2000.0,700.0,0.0,2700.0,25.64,34.62,Apartamento

In [101]:
## Excluindo variáveis do DataFrame
# Modo 1
dados_aux = pd.DataFrame(dados[['Tipo Agregado', 'Valor m2', 'Valor Bruto', 'Valor Bruto m2']])

In [102]:
dados_aux.head(10)

  Tipo Agregado  Valor m2  Valor Bruto  Valor Bruto m2
0   Apartamento     42.50       2260.0           56.50
1          Casa     70.00       7000.0           70.00
2   Apartamento     53.33       1210.0           80.67
3   Apartamento     16.67       1030.0           21.46
4   Apartamento     26.00       1618.0           32.36
5          Casa     29.33      22000.0           29.33
6          Casa     15.38       1000.0           15.38
7   Apartamento     21.43       2216.0           31.66
8   Apartamento     16.67       1969.0           21.88
9   Apartamento     50.00       2611.0           65.28

In [103]:
del dados_aux['Valor Bruto'] # deleta o DataFrame ou var específica
dados_aux.head(10)

  Tipo Agregado  Valor m2  Valor Bruto m2
0   Apartamento     42.50           56.50
1          Casa     70.00           70.00
2   Apartamento     53.33           80.67
3   Apartamento     16.67           21.46
4   Apartamento     26.00           32.36
5          Casa     29.33           29.33
6          Casa     15.38           15.38
7   Apartamento     21.43           31.66
8   Apartamento     16.67           21.88
9   Apartamento     50.00           65.28

In [104]:
# Modo 2
dados_aux.pop('Valor Bruto m2')
dados_aux

      Tipo Agregado  Valor m2
0       Apartamento     42.50
1              Casa     70.00
2       Apartamento     53.33
3       Apartamento     16.67
4       Apartamento     26.00
...             ...       ...
22364   Apartamento     12.86
22365   Apartamento     29.63
22366   Apartamento     23.08
22367   Apartamento     29.17
22368   Apartamento     42.86

[22369 rows x 2 columns]

In [105]:
# Modo 3
dados.drop(['Valor Bruto', 'Valor Bruto m2'], axis=1, inplace=True)
# note que o drop funciona tanto para seleciona linhas qnt colunas
# axis = 1 == coluna
# axis = 0 == linha
# ele recebe também uma lista com os valores a serem excluidos

In [106]:
dados

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU,Valor m2,Tipo Agregado
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0,42.50,Apartamento
1,Casa,Jardim Botânico,2,0,1,100,7000.0,0.0,0.0,70.00,Casa
2,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0,53.33,Apartamento
3,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,0.0,16.67,Apartamento
4,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0,26.00,Apartamento
...,...,...,...,...,...,...,...,...,...,...,...
22364,Apartamento,Méier,2,0,0,70,900.0,490.0,48.0,12.86,Apartamento
22365,Quitinete,Centro,0,0,0,27,800.0,350.0,25.0,29.63,Apartamento
22366,Apartamento,Jacarepaguá,3,1,2,78,1800.0,800.0,40.0,23.08,Apartamento
22367,Apartamento,São Francisco Xavier,2,1,0,48,1400.0,509.0,37.0,29.17,Apartamento
22368,Apartamento,Leblon,2,0,0,70,3000.0,760.0,0.0,42.86,Apartamento

In [107]:
# exportando DataFrame atualizado
dados.to_csv('aluguel_residencial.csv', sep=";", index=False)

#### Extra

In [108]:
## Contadores

In [109]:
s = pd.Series(list('asdasdfasdasdasdaa'))

In [110]:
s

0     a
1     s
2     d
3     a
4     s
5     d
6     f
7     a
8     s
9     d
10    a
11    s
12    d
13    a
14    s
15    d
16    a
17    a
dtype: object

In [111]:
s.unique()

array(['a', 's', 'd', 'f'], dtype=object)

In [112]:
s.value_counts()

a    7
s    5
d    5
f    1
dtype: int64

In [113]:
## tecnica já vista nas aula de data_science

### Parte 8